       IDENTIFICATION DIVISION.
       PROGRAM-ID. INSPECT2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STR          PIC X(12) VALUE 'abracadabra'.
       01 WS-COUNT        PIC 9(3) VALUE 0.
       01 WS-COUNT2       PIC 9(3) VALUE 0.
       01 WS-COUNT3       PIC 9(3) VALUE 0.
       01 WS-COUNT4       PIC 9(3) VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE 0 TO WS-COUNT.
           INSPECT WS-STR TALLYING WS-COUNT FOR ALL 'a'.
           DISPLAY 'ALL-A: ' WS-COUNT.
           MOVE 0 TO WS-COUNT2.
           INSPECT WS-STR TALLYING WS-COUNT2 FOR LEADING 'a'.
           DISPLAY 'LEAD-A: ' WS-COUNT2.
           MOVE 0 TO WS-COUNT3.
           INSPECT WS-STR TALLYING WS-COUNT3 FOR CHARACTERS.
           DISPLAY 'CHARS: ' WS-COUNT3.
           MOVE 0 TO WS-COUNT4.
           INSPECT WS-STR TALLYING WS-COUNT4 FOR ALL 'a' AFTER 'b'.
           DISPLAY 'ALL-A-AFTER-B: ' WS-COUNT4.
           STOP RUN.
